#+TITLE: org-mode.el

** sh

stderr in =sh= blocks is tricky. We can force the exit status of the
final command run by org-babel to be 0 by always executing the bash
built-in =:= as the final command. (This is just an alias for true.
Stole this idea from [[http://kitchingroup.cheme.cmu.edu/blog/2015/01/04/Redirecting-stderr-in-org-mode-shell-blocks/][here]].)

For example, this code block exits with non-zero status, creates a
warning, and prints nothing in the results block.

#+BEGIN_SRC sh
ls /foo/bar 2>&1
#+END_SRC

#+RESULTS:

But this works, if you redirect stderr to stdout.

#+BEGIN_SRC sh :results output
ls /foo/bar 2>&1
:
#+END_SRC

Here's a cleaner way to do it, using prologues and epilogues
(you can put this in the properties block of a header rather than
repeat it for every block).

#+BEGIN_SRC sh :prologue "exec 2>&1" :epilogue ":"
ls /foo/bar
#+END_SRC

#+RESULTS:
: ls: cannot access '/foo/bar': No such file or directory

Or, even better, let's just make this the default for any =sh= src
block.

#+BEGIN_SRC emacs-lisp
  (setq org-babel-default-header-args:sh
        '((:prologue . "exec 2>&1") (:epilogue . ":")))
#+END_SRC

#+BEGIN_SRC sh
    ls /foo/bar
#+END_SRC

#+RESULTS:
: ls: cannot access '/foo/bar': No such file or directory

Sweet!

**** Meeting


#+BEGIN_SRC emacs-lisp
    (add-to-list 'org-capture-templates
	  '("m" "Meeting" entry (file+headline "~/organizer/devlog.org" "Meetings")
             "** %^{Title}
    :PROPERTIES:
    :date:	%t
    :END:
    %?" :jump-to-captured :immediate-finish))
#+END_SRC

#+RESULTS:
| m | Meeting | entry | (file+headline ~/organizer/devlog.org Meetings) | ** %^{Title} |



